README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2023-09-11 Mon 11:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Kent Beck's TDD example by Ruby</title>
<meta name="author" content="Shigeto R. Nishitani" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Kent Beck's TDD example by Ruby</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc05f023">1. Introduction</a></li>
<li><a href="#orgfb7e8da">2. c15 :: Mixed Currencies</a></li>
<li><a href="#orge1ee107">3. c14 :: Change</a></li>
<li><a href="#org4e38972">4. c13 :: Make It</a></li>
<li><a href="#org15a0897">5. c12 :: Addition, Finally</a></li>
<li><a href="#org3cedbb8">6. c11 :: The root of all evil</a></li>
<li><a href="#org8290793">7. c10 :: Interesting times</a></li>
<li><a href="#org34d15cc">8. c9 :: Times We're Livin' in</a></li>
<li><a href="#orgfeef986">9. c8 :: Makin' Objects</a></li>
<li><a href="#org9ff3568">10. c7 :: Apples and Oranges</a></li>
<li><a href="#org5831c79">11. c6 :: Equality for all, Redux</a></li>
<li><a href="#org12fc1cf">12. c5 :: Franc-ly Speaking</a></li>
<li><a href="#org0ee731b">13. c4 :: Privacy</a></li>
<li><a href="#org09beb59">14. c3 :: Equality for All</a></li>
<li><a href="#orgd3b152a">15. c2 :: Degenerate Objects</a></li>
<li><a href="#org488a4d4">16. c1 :: Multi-Currency Money</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc05f023" class="outline-2">
<h2 id="orgc05f023"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Ruby implementations for Kent Beck's 'Test Driven Development by Example'
</p>
</div>
</div>

<div id="outline-container-orgfb7e8da" class="outline-2">
<h2 id="orgfb7e8da"><span class="section-number-2">2.</span> c15 :: Mixed Currencies</h2>
<div class="outline-text-2" id="text-2">
<p>
大体終わったけど，それほど綺麗ではないね．
でも，だいぶ，JavaとRubyの差異がわかった．
さて，テキストにできるかな？？
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> $5 + 10CHF = $10 (if rate is 2:1)</li>
<li class="off"><code>[&#xa0;]</code> Return money from $5 + $5</li>
</ul>
<div class="org-src-container">
<pre class="src src-ruby">test <span style="color: #8b7355;">"mixed addition"</span> <span style="color: #1c86ee;">do</span>
  five_bucks = <span style="color: #00688b;">Money</span>.new(5).dollar
  ten_francs = <span style="color: #00688b;">Money</span>.new(10).franc
  bank = <span style="color: #00688b;">Bank</span>.new
  bank.add_rate(<span style="color: #8b7355;">'CHF'</span>, <span style="color: #8b7355;">'USD'</span>, 2)

  result = bank.reduce(five_bucks.plus(ten_francs), <span style="color: #8b7355;">'USD'</span>)
  assert_true(<span style="color: #00688b;">Money</span>.new(10).dollar.equals(result))
<span style="color: #1c86ee;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Sum</span>
  <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">reduce</span>(bank, to)
    amount = <span style="color: #2e8b57;">@augend</span>.reduce(bank, to).amount +
             <span style="color: #2e8b57;">@addend</span>.reduce(bank, to).amount
    <span style="color: #1c86ee;">return</span> <span style="color: #00688b;">Money</span>.new(amount,to)
  <span style="color: #1c86ee;">end</span>
<span style="color: #1c86ee;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge1ee107" class="outline-2">
<h2 id="orge1ee107"><span class="section-number-2">3.</span> c14 :: Change</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> $5 + 10CHF = $10 (if rate is 2:1)</li>
<li class="off"><code>[&#xa0;]</code> $5 + $5 = $10</li>
<li class="off"><code>[&#xa0;]</code> Return money from $5 + $5</li>
<li class="off"><code>[&#xa0;]</code> Bank.reduce(Money)</li>
<li class="off"><code>[&#xa0;]</code> Reduce Money with conversion</li>
<li class="off"><code>[&#xa0;]</code> Reduce(Bank, String)</li>
</ul>

<p>
変換を実装するのですが，ややこしそうなので，ここで一旦中断．
</p>

<p>
Hashを使ってrateを取り出すことをしている．
Hash KeyをPairから作って，そのkeyから値を入れたり(puts),
出したり(gets)する機能(Map, HashMap)を使っているみたい．
</p>

<p>
実際にHash Key使っているのは， 
Pair.new('CHF', 'USD')でそれ以外はrate=1.0を
返せばいいので，そのままにしておく．
hash_codeの実装を行えば，そこもうまくいくはず．
</p>

<div class="org-src-container">
<pre class="src src-ruby">test <span style="color: #8b7355;">"identity rate"</span> <span style="color: #1c86ee;">do</span>
  assert_equal(1.0, <span style="color: #00688b;">Bank</span>.new.rate(<span style="color: #8b7355;">'USD'</span>, <span style="color: #8b7355;">'USD'</span>))
<span style="color: #1c86ee;">end</span>
test <span style="color: #8b7355;">"hash test"</span> <span style="color: #1c86ee;">do</span>
  rate_table = {<span style="color: #8b7355;">'USD'</span>=&gt;{<span style="color: #8b7355;">'CHF'</span>=&gt;0.5, <span style="color: #8b7355;">'USD'</span>=&gt;1.0},
                <span style="color: #8b7355;">'CHF'</span>=&gt;{<span style="color: #8b7355;">'CHF'</span>=&gt;1.0, <span style="color: #8b7355;">'USD'</span>=&gt;2.0}}
  from = <span style="color: #8b7355;">'CHF'</span>
  to = <span style="color: #8b7355;">'USD'</span>
  assert_equal(2.0, rate_table[from][to])
<span style="color: #1c86ee;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Pair</span>
  <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">initialize</span>(from, to)
    <span style="color: #2e8b57;">@from</span> = from
    <span style="color: #2e8b57;">@to</span> = to
  <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">equals</span>(object)
    pair = <span style="color: #00688b;">Pair</span>.new(object)
    <span style="color: #1c86ee;">return</span> from.equals(pair.from) &amp;&amp; to.equals(pair.to)
  <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">hash_code</span>()
    <span style="color: #1c86ee;">return</span> 0
  <span style="color: #1c86ee;">end</span>
<span style="color: #1c86ee;">end</span>
<span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Bank</span>
  <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">initialize</span>
    <span style="color: #2e8b57;">@rates</span> = {}
  <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">add_rate</span>(from, to, rate)
    <span style="color: #2e8b57;">@rates</span>.store(<span style="color: #00688b;">Pair</span>.new(from,to).hash_code, rate)
  <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">reduce</span>(source, to)
    <span style="color: #1c86ee;">return</span> source.reduce(<span style="color: #1c86ee;">self</span>, to)
  <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">rate</span>(from, to)
    <span style="color: #1c86ee;">return</span> 1.0 <span style="color: #1c86ee;">if</span> from==to
    <span style="color: #1c86ee;">return</span> <span style="color: #2e8b57;">@rates</span>[<span style="color: #00688b;">Pair</span>.new(from,to).hash_code]
  <span style="color: #1c86ee;">end</span>
<span style="color: #1c86ee;">end</span>
<span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Money</span>
  <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">reduce</span>(bank, to)
    rate = bank.rate(<span style="color: #2e8b57;">@currency</span>, to)
    <span style="color: #1c86ee;">return</span> <span style="color: #00688b;">Money</span>.new(<span style="color: #2e8b57;">@amount</span>/rate, to)
  <span style="color: #1c86ee;">end</span>
<span style="color: #1c86ee;">end</span>
</pre>
</div>
</div>
</div>
