README.tex
% Created 2023-09-11 Mon 11:21
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\setcounter{secnumdepth}{2}
\author{Shigeto R. Nishitani}
\date{\today}
\title{Kent Beck's TDD example by Ruby}
\hypersetup{
 pdfauthor={Shigeto R. Nishitani},
 pdftitle={Kent Beck's TDD example by Ruby},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.5.2)}, 
 pdflang={Jp}}
\begin{document}

\maketitle
\tableofcontents


\section{Introduction}
\label{sec:orgcb5f71e}
Ruby implementations for Kent Beck's 'Test Driven Development by Example'

\section{c15 :: Mixed Currencies}
\label{sec:org9f4cd32}
大体終わったけど，それほど綺麗ではないね．
でも，だいぶ，JavaとRubyの差異がわかった．
さて，テキストにできるかな？？

\begin{itemize}
\item[{$\square$}] \$5 + 10CHF = \$10 (if rate is 2:1)
\item[{$\square$}] Return money from \$5 + \$5
\end{itemize}
\begin{verbatim}
test "mixed addition" do
  five_bucks = Money.new(5).dollar
  ten_francs = Money.new(10).franc
  bank = Bank.new
  bank.add_rate('CHF', 'USD', 2)

  result = bank.reduce(five_bucks.plus(ten_francs), 'USD')
  assert_true(Money.new(10).dollar.equals(result))
end
\end{verbatim}

\begin{verbatim}
class Sum
  def reduce(bank, to)
    amount = @augend.reduce(bank, to).amount +
	     @addend.reduce(bank, to).amount
    return Money.new(amount,to)
  end
end
\end{verbatim}

\section{c14 :: Change}
\label{sec:org37746b1}
\begin{itemize}
\item[{$\square$}] \$5 + 10CHF = \$10 (if rate is 2:1)
\item[{$\square$}] \$5 + \$5 = \$10
\item[{$\square$}] Return money from \$5 + \$5
\item[{$\square$}] Bank.reduce(Money)
\item[{$\square$}] Reduce Money with conversion
\item[{$\square$}] Reduce(Bank, String)
\end{itemize}

変換を実装するのですが，ややこしそうなので，ここで一旦中断．

Hashを使ってrateを取り出すことをしている．
Hash KeyをPairから作って，そのkeyから値を入れたり(puts),
出したり(gets)する機能(Map, HashMap)を使っているみたい．

実際にHash Key使っているのは， 
Pair.new('CHF', 'USD')でそれ以外はrate=1.0を
返せばいいので，そのままにしておく．
hash\_codeの実装を行えば，そこもうまくいくはず．

\begin{verbatim}
test "identity rate" do
  assert_equal(1.0, Bank.new.rate('USD', 'USD'))
end
test "hash test" do
  rate_table = {'USD'=>{'CHF'=>0.5, 'USD'=>1.0},
		'CHF'=>{'CHF'=>1.0, 'USD'=>2.0}}
  from = 'CHF'
  to = 'USD'
  assert_equal(2.0, rate_table[from][to])
end
\end{verbatim}

\begin{verbatim}
class Pair
  def initialize(from, to)
    @from = from
    @to = to
  end
  def equals(object)
    pair = Pair.new(object)
    return from.equals(pair.from) && to.equals(pair.to)
  end
  def hash_code()
    return 0
  end
end
class Bank
  def initialize
    @rates = {}
  end
  def add_rate(from, to, rate)
    @rates.store(Pair.new(from,to).hash_code, rate)
  end
  def reduce(source, to)
    return source.reduce(self, to)
  end
  def rate(from, to)
    return 1.0 if from==to
    return @rates[Pair.new(from,to).hash_code]
  end
end
class Money
  def reduce(bank, to)
    rate = bank.rate(@currency, to)
    return Money.new(@amount/rate, to)
  end
end
\end{verbatim}
