README.html

<div id="outline-container-org4e38972" class="outline-2">
<h2 id="org4e38972"><span class="section-number-2">4.</span> c13 :: Make It</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> $5 + 10CHF = $10 (if rate is 2:1)</li>
<li class="off"><code>[&#xa0;]</code> $5 + $5 = $10</li>
<li class="off"><code>[&#xa0;]</code> Return money from $5 + $5</li>
</ul>

<p>
reduceをうまく，bank, sum, moneyに配置することで
codeを綺麗にする．
simple additionは一度動かなくなるが，comment outして
新しいtestで駆動しながら，最後のあたりで復活させる．
</p>

<div class="org-src-container">
<pre class="src src-ruby">  <span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Sum</span>
    <span style="color: #cd6600;">public</span> <span style="color: #cd6600;">attr_reader</span> <span style="color: #6e8b3d;">:augend</span>, <span style="color: #6e8b3d;">:addend</span>
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">initialize</span>(augend, addend)
      <span style="color: #2e8b57;">@augend</span> = augend
      <span style="color: #2e8b57;">@addend</span> = addend
    <span style="color: #1c86ee;">end</span>
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">reduce</span>(to)
      amount = <span style="color: #2e8b57;">@augend</span>.amount + <span style="color: #2e8b57;">@addend</span>.amount
      <span style="color: #1c86ee;">return</span> <span style="color: #00688b;">Money</span>.new(amount,to)
    <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Bank</span>
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">reduce</span>(source, to)
<span style="color: #7f7f7f;">=begin      </span>
<span style="color: #7f7f7f;">      if source.class == Money</span>
<span style="color: #7f7f7f;">        return source.reduce(to)</span>
<span style="color: #7f7f7f;">      end</span>
<span style="color: #7f7f7f;">      sum = source</span>
<span style="color: #7f7f7f;">      return sum.reduce(to)</span>
<span style="color: #7f7f7f;">=end</span>
      <span style="color: #1c86ee;">return</span> source.reduce(to)
    <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Money</span>
...
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">plus</span>(addend)
      <span style="color: #1c86ee;">return</span> <span style="color: #00688b;">Sum</span>.new(<span style="color: #1c86ee;">self</span>, addend)
    <span style="color: #1c86ee;">end</span>
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">reduce</span>(to)
      <span style="color: #1c86ee;">return</span> <span style="color: #1c86ee;">self</span>
    <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org15a0897" class="outline-2">
<h2 id="org15a0897"><span class="section-number-2">5.</span> c12 :: Addition, Finally</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> $5 + 10CHF = $10 (if rate is 2:1)</li>
</ul>
<p>
さて，これ．
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> $5 + $5 = $10</li>
</ul>
<p>
をまずは実装．
</p>

<p>
さらにImposterパターンと呼ばれる手法でれに対処する．
reduce とか expressionとかが入ってくるのですが，
このあたりが難しそうなので，gitしましょう．
</p>

<div class="org-src-container">
<pre class="src src-ruby">test <span style="color: #8b7355;">"simple addition"</span> <span style="color: #1c86ee;">do</span>
  five = <span style="color: #00688b;">Money</span>.new(5).dollar
  sum = five.plus(five)
  bank = <span style="color: #00688b;">Bank</span>.new
  reduce = bank.reduce(sum, <span style="color: #8b7355;">'USD'</span>)
  assert_true(<span style="color: #00688b;">Money</span>.new(10).dollar.equals(reduce))
<span style="color: #1c86ee;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby">  <span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Bank</span>
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">reduce</span>(object, currency)
      amount = object.amount
      <span style="color: #1c86ee;">return</span> <span style="color: #00688b;">Money</span>.new(amount, currency)
    <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Money</span>
    <span style="color: #cd6600;">public</span> <span style="color: #cd6600;">attr_reader</span> <span style="color: #6e8b3d;">:amount</span>
...
</pre>
</div>
<p>
Bank内にreduceだけを作ったが，
ここで，object.amountにアクセスする必要が出てきて，
protected -&gt; publicに変更．
</p>
</div>
</div>
<div id="outline-container-org3cedbb8" class="outline-2">
<h2 id="org3cedbb8"><span class="section-number-2">6.</span> c11 :: The root of all evil</h2>
<div class="outline-text-2" id="text-6">
<p>
subclassを本当に消すには．．．
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> Dollar Franc Duplication
<ul class="org-ul">
<li class="on"><code>[X]</code> Common equals</li>
<li class="on"><code>[X]</code> Common times</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-ruby">test <span style="color: #8b7355;">"dollar multiplication"</span> <span style="color: #1c86ee;">do</span>
  five = <span style="color: #00688b;">Money</span>.new(5).dollar

  <span style="color: #7f7f7f;">#    </span><span style="color: #7f7f7f;">assert_equal(Dollar.new(10), product)</span>
  assert_true(<span style="color: #00688b;">Money</span>.new(10).dollar.equals(five.times(2)))
  assert_true(<span style="color: #00688b;">Money</span>.new(15).dollar.equals(five.times(3)))
<span style="color: #1c86ee;">end</span>

test <span style="color: #8b7355;">"equality"</span> <span style="color: #1c86ee;">do</span>
  assert_true(<span style="color: #00688b;">Money</span>.new(5).dollar.equals(<span style="color: #00688b;">Money</span>.new(5).dollar))
  assert_false(<span style="color: #00688b;">Money</span>.new(5).dollar.equals(<span style="color: #00688b;">Money</span>.new(6).dollar))
  assert_false(<span style="color: #00688b;">Money</span>.new(5).franc.equals(<span style="color: #00688b;">Money</span>.new(5).dollar))
<span style="color: #1c86ee;">end</span>

test <span style="color: #8b7355;">"currency"</span> <span style="color: #1c86ee;">do</span>
  assert_equal(<span style="color: #8b7355;">"USD"</span>, <span style="color: #00688b;">Money</span>.new(1).dollar.currency)
  assert_equal(<span style="color: #8b7355;">"CHF"</span>, <span style="color: #00688b;">Money</span>.new(1).franc.currency)
<span style="color: #1c86ee;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby">  <span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Money</span>
    <span style="color: #cd6600;">protected</span> <span style="color: #cd6600;">attr_reader</span> <span style="color: #6e8b3d;">:amount</span>
    <span style="color: #cd6600;">public</span> <span style="color: #cd6600;">attr_reader</span> <span style="color: #6e8b3d;">:currency</span>
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">initialize</span>(amount, currency=<span style="color: #6e8b3d;">nil</span>)
      <span style="color: #2e8b57;">@amount</span> = amount
      <span style="color: #2e8b57;">@currency</span> = currency
    <span style="color: #1c86ee;">end</span>
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">equals</span>(object)
      money = <span style="color: #00688b;">Money</span>.new(object.amount)
<span style="color: #7f7f7f;">#      </span><span style="color: #7f7f7f;">p [object, money, self]</span>
      <span style="color: #1c86ee;">return</span> <span style="color: #2e8b57;">@amount</span> == money.amount &amp;&amp;
        <span style="color: #7f7f7f;">#        </span><span style="color: #7f7f7f;">self.class == object.class</span>
        <span style="color: #1c86ee;">self</span>.currency == object.currency
    <span style="color: #1c86ee;">end</span>
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">dollar</span>
      <span style="color: #1c86ee;">return</span> <span style="color: #00688b;">Money</span>.new(<span style="color: #2e8b57;">@amount</span>, <span style="color: #8b7355;">'USD'</span>)
    <span style="color: #1c86ee;">end</span>
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">franc</span>
      <span style="color: #1c86ee;">return</span> <span style="color: #00688b;">Money</span>.new(<span style="color: #2e8b57;">@amount</span>, <span style="color: #8b7355;">'CHF'</span>)
    <span style="color: #1c86ee;">end</span>
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">times</span>(multiplier)
      <span style="color: #1c86ee;">return</span> <span style="color: #00688b;">Money</span>.new(<span style="color: #2e8b57;">@amount</span> * multiplier, <span style="color: #2e8b57;">@currency</span>)
    <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">end</span>
</pre>
</div>
</div>
</div>
