README.tex

\section{c13 :: Make It}
\label{sec:orgd22f9f8}
\begin{itemize}
\item[{$\square$}] \$5 + 10CHF = \$10 (if rate is 2:1)
\item[{$\square$}] \$5 + \$5 = \$10
\item[{$\square$}] Return money from \$5 + \$5
\end{itemize}

reduceをうまく，bank, sum, moneyに配置することで
codeを綺麗にする．
simple additionは一度動かなくなるが，comment outして
新しいtestで駆動しながら，最後のあたりで復活させる．

\begin{verbatim}
  class Sum
    public attr_reader :augend, :addend
    def initialize(augend, addend)
      @augend = augend
      @addend = addend
    end
    def reduce(to)
      amount = @augend.amount + @addend.amount
      return Money.new(amount,to)
    end
  end
  class Bank
    def reduce(source, to)
=begin      
      if source.class == Money
	return source.reduce(to)
      end
      sum = source
      return sum.reduce(to)
=end
      return source.reduce(to)
    end
  end
  class Money
...
    def plus(addend)
      return Sum.new(self, addend)
    end
    def reduce(to)
      return self
    end
  end
\end{verbatim}

\section{c12 :: Addition, Finally}
\label{sec:orgba252d1}
\begin{itemize}
\item[{$\square$}] \$5 + 10CHF = \$10 (if rate is 2:1)
\end{itemize}
さて，これ．
\begin{itemize}
\item[{$\square$}] \$5 + \$5 = \$10
\end{itemize}
をまずは実装．

さらにImposterパターンと呼ばれる手法でれに対処する．
reduce とか expressionとかが入ってくるのですが，
このあたりが難しそうなので，gitしましょう．

\begin{verbatim}
test "simple addition" do
  five = Money.new(5).dollar
  sum = five.plus(five)
  bank = Bank.new
  reduce = bank.reduce(sum, 'USD')
  assert_true(Money.new(10).dollar.equals(reduce))
end
\end{verbatim}

\begin{verbatim}
  class Bank
    def reduce(object, currency)
      amount = object.amount
      return Money.new(amount, currency)
    end
  end
  class Money
    public attr_reader :amount
...
\end{verbatim}
Bank内にreduceだけを作ったが，
ここで，object.amountにアクセスする必要が出てきて，
protected -> publicに変更．
\section{c11 :: The root of all evil}
\label{sec:org44852f8}
subclassを本当に消すには．．．

\begin{itemize}
\item[{$\boxtimes$}] Dollar Franc Duplication
\begin{itemize}
\item[{$\boxtimes$}] Common equals
\item[{$\boxtimes$}] Common times
\end{itemize}
\end{itemize}
\begin{verbatim}
test "dollar multiplication" do
  five = Money.new(5).dollar

  #    assert_equal(Dollar.new(10), product)
  assert_true(Money.new(10).dollar.equals(five.times(2)))
  assert_true(Money.new(15).dollar.equals(five.times(3)))
end

test "equality" do
  assert_true(Money.new(5).dollar.equals(Money.new(5).dollar))
  assert_false(Money.new(5).dollar.equals(Money.new(6).dollar))
  assert_false(Money.new(5).franc.equals(Money.new(5).dollar))
end

test "currency" do
  assert_equal("USD", Money.new(1).dollar.currency)
  assert_equal("CHF", Money.new(1).franc.currency)
end
\end{verbatim}

\begin{verbatim}
  class Money
    protected attr_reader :amount
    public attr_reader :currency
    def initialize(amount, currency=nil)
      @amount = amount
      @currency = currency
    end
    def equals(object)
      money = Money.new(object.amount)
#      p [object, money, self]
      return @amount == money.amount &&
	#        self.class == object.class
	self.currency == object.currency
    end
    def dollar
      return Money.new(@amount, 'USD')
    end
    def franc
      return Money.new(@amount, 'CHF')
    end
    def times(multiplier)
      return Money.new(@amount * multiplier, @currency)
    end
  end
\end{verbatim}
