README.org
* c10 :: Interesting times
timesを統一して，subclassを消しちゃう．
- [ ] Common times

toStringは面倒なので，pメソッドで代用．
equalsで出力．
classが違うことを確認できる．

#+begin_src ruby
  test "different class equality" do
    assert_true(Money.new(10, 'CHF').equals(Franc.new(10, 'CHF')))
  end
#+end_src

#+begin_src ruby
  class Money
...
    def times(multiplier)
      return Money.new(@amount * multiplier, @currency)
    end
  end
  class Dollar < Money
  end
  class Franc < Money
  end
#+end_src

* c9 :: Times We're Livin' in
通貨の概念を，文字列で代用してみる．
- [ ] Currency?
- [ ] Delete test Franc Multiplications?

CHF stands for Confoederatio Helvetica franc, 
where Confoederatio Helvetica is the Latin name for 
the Swiss Confederation.

Money classへの統合を試みるわけだが，
class生成時のdefaultをうまく使わないと
テストを大幅に書き換える必要が出てくる．

すなわち
#+begin_src ruby
  class Money
    protected attr_reader :amount
    public attr_reader :currency
    def initialize(amount, currency=nil)
      @amount = amount
      @currency = currency
    end
#+end_src
としてcurrencyが定義されてなくてもMoneyは生成されて，
さらに，Money.new(5).dollarとかで初めてちゃんと'USD'を
定義したclassのインスタンスが生成されるようにする．
いいのかな．．．Money.new(5, 'USD')がいいよね．
全部そうした方が．．．

#+begin_src ruby
  test "currency" do
    assert_equal("USD", Money.new(1).dollar.currency)
    assert_equal("CHF", Money.new(1).franc.currency)
  end
#+end_src

#+begin_src ruby
  class Money
    protected attr_reader :amount
    public attr_reader :currency
    def initialize(amount, currency=nil)
      @amount = amount
      @currency = currency
    end
    def equals(object)
      money = Money.new(object.amount)
      return @amount == money.amount &&
        self.class == object.class
    end
    def dollar
      return Dollar.new(@amount, 'USD')
    end
    def franc
      return Franc.new(@amount, 'CHF')
    end
  end
  class Dollar < Money
    def initialize(amount, currency)
      super(amount, currency)
#      @currency = 'CHF'
    end
    def times(multiplier)
      return Money.new(@amount * multiplier).dollar
    end
  end
  class Franc < Money
    def initialize(amount, currency)
      super(amount, currency)
#      @currency = 'CHF'
    end
    def times(multiplier)
      return Money.new(@amount * multiplier).franc
    end
  end
#+end_src
subclass Dollar, Francのinitializeは消してもいいが今は，そのまま．

