README.html
<div id="outline-container-org8290793" class="outline-2">
<h2 id="org8290793"><span class="section-number-2">7.</span> c10 :: Interesting times</h2>
<div class="outline-text-2" id="text-7">
<p>
timesを統一して，subclassを消しちゃう．
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Common times</li>
</ul>

<p>
toStringは面倒なので，pメソッドで代用．
equalsで出力．
classが違うことを確認できる．
</p>

<div class="org-src-container">
<pre class="src src-ruby">test <span style="color: #8b7355;">"different class equality"</span> <span style="color: #1c86ee;">do</span>
  assert_true(<span style="color: #00688b;">Money</span>.new(10, <span style="color: #8b7355;">'CHF'</span>).equals(<span style="color: #00688b;">Franc</span>.new(10, <span style="color: #8b7355;">'CHF'</span>)))
<span style="color: #1c86ee;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby">  <span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Money</span>
...
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">times</span>(multiplier)
      <span style="color: #1c86ee;">return</span> <span style="color: #00688b;">Money</span>.new(<span style="color: #2e8b57;">@amount</span> * multiplier, <span style="color: #2e8b57;">@currency</span>)
    <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Dollar</span> &lt; <span style="color: #00688b;">Money</span>
  <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Franc</span> &lt; <span style="color: #00688b;">Money</span>
  <span style="color: #1c86ee;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org34d15cc" class="outline-2">
<h2 id="org34d15cc"><span class="section-number-2">8.</span> c9 :: Times We're Livin' in</h2>
<div class="outline-text-2" id="text-8">
<p>
通貨の概念を，文字列で代用してみる．
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Currency?</li>
<li class="off"><code>[&#xa0;]</code> Delete test Franc Multiplications?</li>
</ul>

<p>
CHF stands for Confoederatio Helvetica franc, 
where Confoederatio Helvetica is the Latin name for 
the Swiss Confederation.
</p>

<p>
Money classへの統合を試みるわけだが，
class生成時のdefaultをうまく使わないと
テストを大幅に書き換える必要が出てくる．
</p>

<p>
すなわち
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Money</span>
  <span style="color: #cd6600;">protected</span> <span style="color: #cd6600;">attr_reader</span> <span style="color: #6e8b3d;">:amount</span>
  <span style="color: #cd6600;">public</span> <span style="color: #cd6600;">attr_reader</span> <span style="color: #6e8b3d;">:currency</span>
  <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">initialize</span>(amount, currency=<span style="color: #6e8b3d;">nil</span>)
    <span style="color: #2e8b57;">@amount</span> = amount
    <span style="color: #2e8b57;">@currency</span> = currency
  <span style="color: #1c86ee;">end</span>
</pre>
</div>
<p>
としてcurrencyが定義されてなくてもMoneyは生成されて，
さらに，Money.new(5).dollarとかで初めてちゃんと'USD'を
定義したclassのインスタンスが生成されるようにする．
いいのかな．．．Money.new(5, 'USD')がいいよね．
全部そうした方が．．．
</p>

<div class="org-src-container">
<pre class="src src-ruby">test <span style="color: #8b7355;">"currency"</span> <span style="color: #1c86ee;">do</span>
  assert_equal(<span style="color: #8b7355;">"USD"</span>, <span style="color: #00688b;">Money</span>.new(1).dollar.currency)
  assert_equal(<span style="color: #8b7355;">"CHF"</span>, <span style="color: #00688b;">Money</span>.new(1).franc.currency)
<span style="color: #1c86ee;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby">  <span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Money</span>
    <span style="color: #cd6600;">protected</span> <span style="color: #cd6600;">attr_reader</span> <span style="color: #6e8b3d;">:amount</span>
    <span style="color: #cd6600;">public</span> <span style="color: #cd6600;">attr_reader</span> <span style="color: #6e8b3d;">:currency</span>
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">initialize</span>(amount, currency=<span style="color: #6e8b3d;">nil</span>)
      <span style="color: #2e8b57;">@amount</span> = amount
      <span style="color: #2e8b57;">@currency</span> = currency
    <span style="color: #1c86ee;">end</span>
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">equals</span>(object)
      money = <span style="color: #00688b;">Money</span>.new(object.amount)
      <span style="color: #1c86ee;">return</span> <span style="color: #2e8b57;">@amount</span> == money.amount &amp;&amp;
        <span style="color: #1c86ee;">self</span>.class == object.class
    <span style="color: #1c86ee;">end</span>
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">dollar</span>
      <span style="color: #1c86ee;">return</span> <span style="color: #00688b;">Dollar</span>.new(<span style="color: #2e8b57;">@amount</span>, <span style="color: #8b7355;">'USD'</span>)
    <span style="color: #1c86ee;">end</span>
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">franc</span>
      <span style="color: #1c86ee;">return</span> <span style="color: #00688b;">Franc</span>.new(<span style="color: #2e8b57;">@amount</span>, <span style="color: #8b7355;">'CHF'</span>)
    <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Dollar</span> &lt; <span style="color: #00688b;">Money</span>
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">initialize</span>(amount, currency)
      <span style="color: #1c86ee;">super</span>(amount, currency)
<span style="color: #7f7f7f;">#      </span><span style="color: #7f7f7f;">@currency = 'CHF'</span>
    <span style="color: #1c86ee;">end</span>
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">times</span>(multiplier)
      <span style="color: #1c86ee;">return</span> <span style="color: #00688b;">Money</span>.new(<span style="color: #2e8b57;">@amount</span> * multiplier).dollar
    <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Franc</span> &lt; <span style="color: #00688b;">Money</span>
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">initialize</span>(amount, currency)
      <span style="color: #1c86ee;">super</span>(amount, currency)
<span style="color: #7f7f7f;">#      </span><span style="color: #7f7f7f;">@currency = 'CHF'</span>
    <span style="color: #1c86ee;">end</span>
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">times</span>(multiplier)
      <span style="color: #1c86ee;">return</span> <span style="color: #00688b;">Money</span>.new(<span style="color: #2e8b57;">@amount</span> * multiplier).franc
    <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">end</span>
</pre>
</div>
<p>
subclass Dollar, Francのinitializeは消してもいいが今は，そのまま．
</p>
</div>
</div>
