README.org
* c8 :: Makin' Objects
FrancとDollarを消そうというのだが，
それは，times? で終わるんだろうか？
まずFactory methodを使う．
- [-] Dollar Franc Duplication
  - [X] Common equals
  - [ ] Common times

#+begin_src ruby
  test "dollar multiplication" do
    five = Money.new(5).dollar

    #    assert_equal(Dollar.new(10), product)
    assert_true(Money.new(10).dollar.equals(five.times(2)))
    assert_true(Money.new(15).dollar.equals(five.times(3)))
  end

  test "franc multiplication" do
    five = Money.new(5).franc

    #    assert_equal(Dollar.new(10), product)
    assert_true(Money.new(10).franc.equals(five.times(2)))
    assert_true(Money.new(15).franc.equals(five.times(3)))
  end

  test "equality" do
    assert_true(Money.new(5).dollar.equals(Money.new(5).dollar))
    assert_false(Money.new(5).dollar.equals(Money.new(6).dollar))
    assert_true(Money.new(5).franc.equals(Money.new(5).franc))
    assert_false(Money.new(5).franc.equals(Money.new(6).franc))
    assert_false(Money.new(5).franc.equals(Money.new(5).dollar))
  end
#+end_src

#+begin_src ruby
    def dollar
      return Dollar.new(@amount)
    end
    def franc
      return Franc.new(@amount)
    end
#+end_src

* c7 :: Apples and Oranges
FrancとDollarを比べる．
- [X] Compare Francs with Dollars
- [ ] Currency?

- [ ] 疑問
  textに従うと，
  : self.class == money.class
  とするべきだが，明らかに失敗するので，
  : self.class == object.class
  としている．

* c6 :: Equality for all, Redux
前章でやったDollarをコピペしてFrancに変えちゃうのでは，
重複が多すぎるので，共通の親クラスを作ってReduxする．
- [ ] $5 + 10CHF = $10 (if rate is 2:1)
- [X] $5 * 2 = $10
- [X] Make "amount" private(protected)
- [X] Dollar side-effects?
- [ ] Money rounding?
- [X] equals()
- [ ] hashCode()
- [ ] equal null
- [ ] Equal object
- [ ] 5 CHF *2 = 10 CHF
- [-] Dollar Franc Duplication
  - [X] Common equals
  - [ ] Common times

- [ ] 疑問
  p. 75あたりのobjectのキャストがうまくいかない．
  : money = Money.new(object)
  ではダメで，
  : money = Money.new(object.amount)
  として対応．これが後で不幸を招くかも．
  ついでにinitializeもMoneyで作っておく必要がある．

#+begin_src ruby
  test "equality" do
    assert_true(Dollar.new(5).equals(Dollar.new(5)))
    assert_false(Dollar.new(5).equals(Dollar.new(6)))
    assert_true(Franc.new(5).equals(Franc.new(5)))
    assert_false(Franc.new(5).equals(Franc.new(6)))
  end
#+end_src

#+begin_src ruby
  class Money
    protected attr_reader :amount
    def initialize(amount)
      @amount = amount
    end
    def equals(object)
      money = Money.new(object.amount)
      return @amount == money.amount
    end
  end
  class Dollar < Money
    def times(multiplier)
      return Dollar.new(@amount * multiplier)
    end
  end
  class Franc < Money
    def times(multiplier)
      return Franc.new(@amount * multiplier)
    end
  end
#+end_src

