README.html

<div id="outline-container-orgfeef986" class="outline-2">
<h2 id="orgfeef986"><span class="section-number-2">9.</span> c8 :: Makin' Objects</h2>
<div class="outline-text-2" id="text-9">
<p>
FrancとDollarを消そうというのだが，
それは，times? で終わるんだろうか？
まずFactory methodを使う．
</p>
<ul class="org-ul">
<li class="trans"><code>[-]</code> Dollar Franc Duplication
<ul class="org-ul">
<li class="on"><code>[X]</code> Common equals</li>
<li class="off"><code>[&#xa0;]</code> Common times</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-ruby">test <span style="color: #8b7355;">"dollar multiplication"</span> <span style="color: #1c86ee;">do</span>
  five = <span style="color: #00688b;">Money</span>.new(5).dollar

  <span style="color: #7f7f7f;">#    </span><span style="color: #7f7f7f;">assert_equal(Dollar.new(10), product)</span>
  assert_true(<span style="color: #00688b;">Money</span>.new(10).dollar.equals(five.times(2)))
  assert_true(<span style="color: #00688b;">Money</span>.new(15).dollar.equals(five.times(3)))
<span style="color: #1c86ee;">end</span>

test <span style="color: #8b7355;">"franc multiplication"</span> <span style="color: #1c86ee;">do</span>
  five = <span style="color: #00688b;">Money</span>.new(5).franc

  <span style="color: #7f7f7f;">#    </span><span style="color: #7f7f7f;">assert_equal(Dollar.new(10), product)</span>
  assert_true(<span style="color: #00688b;">Money</span>.new(10).franc.equals(five.times(2)))
  assert_true(<span style="color: #00688b;">Money</span>.new(15).franc.equals(five.times(3)))
<span style="color: #1c86ee;">end</span>

test <span style="color: #8b7355;">"equality"</span> <span style="color: #1c86ee;">do</span>
  assert_true(<span style="color: #00688b;">Money</span>.new(5).dollar.equals(<span style="color: #00688b;">Money</span>.new(5).dollar))
  assert_false(<span style="color: #00688b;">Money</span>.new(5).dollar.equals(<span style="color: #00688b;">Money</span>.new(6).dollar))
  assert_true(<span style="color: #00688b;">Money</span>.new(5).franc.equals(<span style="color: #00688b;">Money</span>.new(5).franc))
  assert_false(<span style="color: #00688b;">Money</span>.new(5).franc.equals(<span style="color: #00688b;">Money</span>.new(6).franc))
  assert_false(<span style="color: #00688b;">Money</span>.new(5).franc.equals(<span style="color: #00688b;">Money</span>.new(5).dollar))
<span style="color: #1c86ee;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">dollar</span>
  <span style="color: #1c86ee;">return</span> <span style="color: #00688b;">Dollar</span>.new(<span style="color: #2e8b57;">@amount</span>)
<span style="color: #1c86ee;">end</span>
<span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">franc</span>
  <span style="color: #1c86ee;">return</span> <span style="color: #00688b;">Franc</span>.new(<span style="color: #2e8b57;">@amount</span>)
<span style="color: #1c86ee;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9ff3568" class="outline-2">
<h2 id="org9ff3568"><span class="section-number-2">10.</span> c7 :: Apples and Oranges</h2>
<div class="outline-text-2" id="text-10">
<p>
FrancとDollarを比べる．
</p>
<ul class="org-ul">
<li class="on"><code>[X]</code> Compare Francs with Dollars</li>
<li class="off"><code>[&#xa0;]</code> Currency?</li>

<li class="off"><code>[&#xa0;]</code> <p>
疑問
textに従うと，
</p>
<pre class="example">
self.class == money.class
</pre>

<p>
とするべきだが，明らかに失敗するので，
</p>
<pre class="example">
self.class == object.class
</pre>

<p>
としている．
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org5831c79" class="outline-2">
<h2 id="org5831c79"><span class="section-number-2">11.</span> c6 :: Equality for all, Redux</h2>
<div class="outline-text-2" id="text-11">
<p>
前章でやったDollarをコピペしてFrancに変えちゃうのでは，
重複が多すぎるので，共通の親クラスを作ってReduxする．
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> $5 + 10CHF = $10 (if rate is 2:1)</li>
<li class="on"><code>[X]</code> $5 * 2 = $10</li>
<li class="on"><code>[X]</code> Make "amount" private(protected)</li>
<li class="on"><code>[X]</code> Dollar side-effects?</li>
<li class="off"><code>[&#xa0;]</code> Money rounding?</li>
<li class="on"><code>[X]</code> equals()</li>
<li class="off"><code>[&#xa0;]</code> hashCode()</li>
<li class="off"><code>[&#xa0;]</code> equal null</li>
<li class="off"><code>[&#xa0;]</code> Equal object</li>
<li class="off"><code>[&#xa0;]</code> 5 CHF *2 = 10 CHF</li>
<li class="trans"><code>[-]</code> Dollar Franc Duplication
<ul class="org-ul">
<li class="on"><code>[X]</code> Common equals</li>
<li class="off"><code>[&#xa0;]</code> Common times</li>
</ul></li>

<li class="off"><code>[&#xa0;]</code> <p>
疑問
p. 75あたりのobjectのキャストがうまくいかない．
</p>
<pre class="example">
money = Money.new(object)
</pre>

<p>
ではダメで，
</p>
<pre class="example">
money = Money.new(object.amount)
</pre>

<p>
として対応．これが後で不幸を招くかも．
ついでにinitializeもMoneyで作っておく必要がある．
</p></li>
</ul>

<div class="org-src-container">
<pre class="src src-ruby">test <span style="color: #8b7355;">"equality"</span> <span style="color: #1c86ee;">do</span>
  assert_true(<span style="color: #00688b;">Dollar</span>.new(5).equals(<span style="color: #00688b;">Dollar</span>.new(5)))
  assert_false(<span style="color: #00688b;">Dollar</span>.new(5).equals(<span style="color: #00688b;">Dollar</span>.new(6)))
  assert_true(<span style="color: #00688b;">Franc</span>.new(5).equals(<span style="color: #00688b;">Franc</span>.new(5)))
  assert_false(<span style="color: #00688b;">Franc</span>.new(5).equals(<span style="color: #00688b;">Franc</span>.new(6)))
<span style="color: #1c86ee;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Money</span>
  <span style="color: #cd6600;">protected</span> <span style="color: #cd6600;">attr_reader</span> <span style="color: #6e8b3d;">:amount</span>
  <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">initialize</span>(amount)
    <span style="color: #2e8b57;">@amount</span> = amount
  <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">equals</span>(object)
    money = <span style="color: #00688b;">Money</span>.new(object.amount)
    <span style="color: #1c86ee;">return</span> <span style="color: #2e8b57;">@amount</span> == money.amount
  <span style="color: #1c86ee;">end</span>
<span style="color: #1c86ee;">end</span>
<span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Dollar</span> &lt; <span style="color: #00688b;">Money</span>
  <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">times</span>(multiplier)
    <span style="color: #1c86ee;">return</span> <span style="color: #00688b;">Dollar</span>.new(<span style="color: #2e8b57;">@amount</span> * multiplier)
  <span style="color: #1c86ee;">end</span>
<span style="color: #1c86ee;">end</span>
<span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Franc</span> &lt; <span style="color: #00688b;">Money</span>
  <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">times</span>(multiplier)
    <span style="color: #1c86ee;">return</span> <span style="color: #00688b;">Franc</span>.new(<span style="color: #2e8b57;">@amount</span> * multiplier)
  <span style="color: #1c86ee;">end</span>
<span style="color: #1c86ee;">end</span>
</pre>
</div>
</div>
</div>
