README.tex

\section{c8 :: Makin' Objects}
\label{sec:org4a593d9}
FrancとDollarを消そうというのだが，
それは，times? で終わるんだろうか？
まずFactory methodを使う．
\begin{itemize}
\item[{$\boxminus$}] Dollar Franc Duplication
\begin{itemize}
\item[{$\boxtimes$}] Common equals
\item[{$\square$}] Common times
\end{itemize}
\end{itemize}

\begin{verbatim}
test "dollar multiplication" do
  five = Money.new(5).dollar

  #    assert_equal(Dollar.new(10), product)
  assert_true(Money.new(10).dollar.equals(five.times(2)))
  assert_true(Money.new(15).dollar.equals(five.times(3)))
end

test "franc multiplication" do
  five = Money.new(5).franc

  #    assert_equal(Dollar.new(10), product)
  assert_true(Money.new(10).franc.equals(five.times(2)))
  assert_true(Money.new(15).franc.equals(five.times(3)))
end

test "equality" do
  assert_true(Money.new(5).dollar.equals(Money.new(5).dollar))
  assert_false(Money.new(5).dollar.equals(Money.new(6).dollar))
  assert_true(Money.new(5).franc.equals(Money.new(5).franc))
  assert_false(Money.new(5).franc.equals(Money.new(6).franc))
  assert_false(Money.new(5).franc.equals(Money.new(5).dollar))
end
\end{verbatim}

\begin{verbatim}
def dollar
  return Dollar.new(@amount)
end
def franc
  return Franc.new(@amount)
end
\end{verbatim}

\section{c7 :: Apples and Oranges}
\label{sec:org28bbda2}
FrancとDollarを比べる．
\begin{itemize}
\item[{$\boxtimes$}] Compare Francs with Dollars
\item[{$\square$}] Currency?

\item[{$\square$}] 疑問
textに従うと，
\begin{verbatim}
self.class == money.class
\end{verbatim}

とするべきだが，明らかに失敗するので，
\begin{verbatim}
self.class == object.class
\end{verbatim}

としている．
\end{itemize}

\section{c6 :: Equality for all, Redux}
\label{sec:orgb984f11}
前章でやったDollarをコピペしてFrancに変えちゃうのでは，
重複が多すぎるので，共通の親クラスを作ってReduxする．
\begin{itemize}
\item[{$\square$}] \$5 + 10CHF = \$10 (if rate is 2:1)
\item[{$\boxtimes$}] \$5 * 2 = \$10
\item[{$\boxtimes$}] Make "amount" private(protected)
\item[{$\boxtimes$}] Dollar side-effects?
\item[{$\square$}] Money rounding?
\item[{$\boxtimes$}] equals()
\item[{$\square$}] hashCode()
\item[{$\square$}] equal null
\item[{$\square$}] Equal object
\item[{$\square$}] 5 CHF *2 = 10 CHF
\item[{$\boxminus$}] Dollar Franc Duplication
\begin{itemize}
\item[{$\boxtimes$}] Common equals
\item[{$\square$}] Common times
\end{itemize}

\item[{$\square$}] 疑問
p. 75あたりのobjectのキャストがうまくいかない．
\begin{verbatim}
money = Money.new(object)
\end{verbatim}

ではダメで，
\begin{verbatim}
money = Money.new(object.amount)
\end{verbatim}

として対応．これが後で不幸を招くかも．
ついでにinitializeもMoneyで作っておく必要がある．
\end{itemize}

\begin{verbatim}
test "equality" do
  assert_true(Dollar.new(5).equals(Dollar.new(5)))
  assert_false(Dollar.new(5).equals(Dollar.new(6)))
  assert_true(Franc.new(5).equals(Franc.new(5)))
  assert_false(Franc.new(5).equals(Franc.new(6)))
end
\end{verbatim}

\begin{verbatim}
class Money
  protected attr_reader :amount
  def initialize(amount)
    @amount = amount
  end
  def equals(object)
    money = Money.new(object.amount)
    return @amount == money.amount
  end
end
class Dollar < Money
  def times(multiplier)
    return Dollar.new(@amount * multiplier)
  end
end
class Franc < Money
  def times(multiplier)
    return Franc.new(@amount * multiplier)
  end
end
\end{verbatim}
