README.org
* c5 :: Franc-ly Speaking
- [ ] $5 + 10CHF = $10 (if rate is 2:1)
- [X] $5 * 2 = $10
- [X] Make "amount" private(protected)
- [X] Dollar side-effects?
- [ ] Money rounding?
- [X] equals()
- [ ] hashCode()
- [ ] equal null
- [ ] Equal object
- [ ] 5 CHF *2 = 10 CHF

#+begin_src ruby
  test "franc multiplication" do
    five = Franc.new(5)

    #    assert_equal(Dollar.new(10), product)
    assert_true(Franc.new(10).equals(five.times(2)))
    assert_true(Franc.new(15).equals(five.times(3)))
  end
#+end_src

#+begin_src ruby
  class Franc
    protected attr_reader :amount
    def initialize(amount)
      @amount = amount
    end
    def times(multiplier)
      return Franc.new(@amount * multiplier)
    end
    def equals(object)
      franc = object
      return @amount == franc.amount
    end
  end
#+end_src

* c4 :: Privacy
- [ ] $5 + 10CHF = $10 (if rate is 2:1)
- [X] $5 * 2 = $10
- [X] Make "amount" private(protected)
- [X] Dollar side-effects?
- [ ] Money rounding?
- [X] equals()
- [ ] hashCode()
- [ ] equal null
- [ ] Equal object

- [ ] 疑問1
  c4の最初のtest変更はobject同士の比較となる．
  :  assert_equal(Dollar.new(10), product)
  javaのassertEqualsのpropertyと思われるが，
  assertEqualsが最初の引数のequals関数を呼び出しているものと
  思われる．
  Rubyでこれを実装するのは難しそう．なので，
  : assert_true(Dollar.new(10).equals(product))
  と書き換える．Dollarの実装はそのまま．

- [ ] 疑問2
  「@amountをprivateにする」という説明があるが，
  これを失敗する．
  equals method内でdollar.amountを使っているから．
  この辺り，JavaのprivateとRubyのprivateの違いかも．
  ここをRubyではprotectedにしている．
  Rubyのprotected, private, public宣言は3.0からなので
  注意が必要かも．

#+begin_src ruby
  class Dollar
    protected attr_reader :amount
#+end_src

#+begin_src ruby
  test "multiplication" do
    five = Dollar.new(5)

    #    assert_equal(Dollar.new(10), product)
    assert_true(Dollar.new(10).equals(five.times(2)))
    assert_true(Dollar.new(15).equals(five.times(3)))
  end
#+end_src
* c3 :: Equality for All
- [ ] $5 + 10CHF = $10 (if rate is 2:1)
- [X] $5 * 2 = $10
- [ ] Make "amount" private
- [X] Dollar side-effects?
- [ ] Money rounding?
- [X] equals()
- [ ] hashCode()

#+begin_src ruby
  test "equality" do
    assert_true(Dollar.new(5).equals(Dollar.new(5)))
    assert_false(Dollar.new(5).equals(Dollar.new(6)))
  end
#+end_src

#+begin_src ruby
    def equals(object)
      dollar = object
      return @amount == dollar.amount
    end
#+end_src

