README.html

<div id="outline-container-org12fc1cf" class="outline-2">
<h2 id="org12fc1cf"><span class="section-number-2">12.</span> c5 :: Franc-ly Speaking</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> $5 + 10CHF = $10 (if rate is 2:1)</li>
<li class="on"><code>[X]</code> $5 * 2 = $10</li>
<li class="on"><code>[X]</code> Make "amount" private(protected)</li>
<li class="on"><code>[X]</code> Dollar side-effects?</li>
<li class="off"><code>[&#xa0;]</code> Money rounding?</li>
<li class="on"><code>[X]</code> equals()</li>
<li class="off"><code>[&#xa0;]</code> hashCode()</li>
<li class="off"><code>[&#xa0;]</code> equal null</li>
<li class="off"><code>[&#xa0;]</code> Equal object</li>
<li class="off"><code>[&#xa0;]</code> 5 CHF *2 = 10 CHF</li>
</ul>

<div class="org-src-container">
<pre class="src src-ruby">test <span style="color: #8b7355;">"franc multiplication"</span> <span style="color: #1c86ee;">do</span>
  five = <span style="color: #00688b;">Franc</span>.new(5)

  <span style="color: #7f7f7f;">#    </span><span style="color: #7f7f7f;">assert_equal(Dollar.new(10), product)</span>
  assert_true(<span style="color: #00688b;">Franc</span>.new(10).equals(five.times(2)))
  assert_true(<span style="color: #00688b;">Franc</span>.new(15).equals(five.times(3)))
<span style="color: #1c86ee;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Franc</span>
  <span style="color: #cd6600;">protected</span> <span style="color: #cd6600;">attr_reader</span> <span style="color: #6e8b3d;">:amount</span>
  <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">initialize</span>(amount)
    <span style="color: #2e8b57;">@amount</span> = amount
  <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">times</span>(multiplier)
    <span style="color: #1c86ee;">return</span> <span style="color: #00688b;">Franc</span>.new(<span style="color: #2e8b57;">@amount</span> * multiplier)
  <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">equals</span>(object)
    franc = object
    <span style="color: #1c86ee;">return</span> <span style="color: #2e8b57;">@amount</span> == franc.amount
  <span style="color: #1c86ee;">end</span>
<span style="color: #1c86ee;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0ee731b" class="outline-2">
<h2 id="org0ee731b"><span class="section-number-2">13.</span> c4 :: Privacy</h2>
<div class="outline-text-2" id="text-13">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> $5 + 10CHF = $10 (if rate is 2:1)</li>
<li class="on"><code>[X]</code> $5 * 2 = $10</li>
<li class="on"><code>[X]</code> Make "amount" private(protected)</li>
<li class="on"><code>[X]</code> Dollar side-effects?</li>
<li class="off"><code>[&#xa0;]</code> Money rounding?</li>
<li class="on"><code>[X]</code> equals()</li>
<li class="off"><code>[&#xa0;]</code> hashCode()</li>
<li class="off"><code>[&#xa0;]</code> equal null</li>
<li class="off"><code>[&#xa0;]</code> Equal object</li>

<li class="off"><code>[&#xa0;]</code> <p>
疑問1
c4の最初のtest変更はobject同士の比較となる．
</p>
<pre class="example">
assert_equal(Dollar.new(10), product)
</pre>

<p>
javaのassertEqualsのpropertyと思われるが，
assertEqualsが最初の引数のequals関数を呼び出しているものと
思われる．
Rubyでこれを実装するのは難しそう．なので，
</p>
<pre class="example">
assert_true(Dollar.new(10).equals(product))
</pre>

<p>
と書き換える．Dollarの実装はそのまま．
</p></li>

<li class="off"><code>[&#xa0;]</code> 疑問2
「@amountをprivateにする」という説明があるが，
これを失敗する．
equals method内でdollar.amountを使っているから．
この辺り，JavaのprivateとRubyのprivateの違いかも．
ここをRubyではprotectedにしている．
Rubyのprotected, private, public宣言は3.0からなので
注意が必要かも．</li>
</ul>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Dollar</span>
  <span style="color: #cd6600;">protected</span> <span style="color: #cd6600;">attr_reader</span> <span style="color: #6e8b3d;">:amount</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby">test <span style="color: #8b7355;">"multiplication"</span> <span style="color: #1c86ee;">do</span>
  five = <span style="color: #00688b;">Dollar</span>.new(5)

  <span style="color: #7f7f7f;">#    </span><span style="color: #7f7f7f;">assert_equal(Dollar.new(10), product)</span>
  assert_true(<span style="color: #00688b;">Dollar</span>.new(10).equals(five.times(2)))
  assert_true(<span style="color: #00688b;">Dollar</span>.new(15).equals(five.times(3)))
<span style="color: #1c86ee;">end</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org09beb59" class="outline-2">
<h2 id="org09beb59"><span class="section-number-2">14.</span> c3 :: Equality for All</h2>
<div class="outline-text-2" id="text-14">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> $5 + 10CHF = $10 (if rate is 2:1)</li>
<li class="on"><code>[X]</code> $5 * 2 = $10</li>
<li class="off"><code>[&#xa0;]</code> Make "amount" private</li>
<li class="on"><code>[X]</code> Dollar side-effects?</li>
<li class="off"><code>[&#xa0;]</code> Money rounding?</li>
<li class="on"><code>[X]</code> equals()</li>
<li class="off"><code>[&#xa0;]</code> hashCode()</li>
</ul>

<div class="org-src-container">
<pre class="src src-ruby">test <span style="color: #8b7355;">"equality"</span> <span style="color: #1c86ee;">do</span>
  assert_true(<span style="color: #00688b;">Dollar</span>.new(5).equals(<span style="color: #00688b;">Dollar</span>.new(5)))
  assert_false(<span style="color: #00688b;">Dollar</span>.new(5).equals(<span style="color: #00688b;">Dollar</span>.new(6)))
<span style="color: #1c86ee;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">equals</span>(object)
  dollar = object
  <span style="color: #1c86ee;">return</span> <span style="color: #2e8b57;">@amount</span> == dollar.amount
<span style="color: #1c86ee;">end</span>
</pre>
</div>
</div>
</div>
