README.tex

\section{c5 :: Franc-ly Speaking}
\label{sec:orgb7ceb0c}
\begin{itemize}
\item[{$\square$}] \$5 + 10CHF = \$10 (if rate is 2:1)
\item[{$\boxtimes$}] \$5 * 2 = \$10
\item[{$\boxtimes$}] Make "amount" private(protected)
\item[{$\boxtimes$}] Dollar side-effects?
\item[{$\square$}] Money rounding?
\item[{$\boxtimes$}] equals()
\item[{$\square$}] hashCode()
\item[{$\square$}] equal null
\item[{$\square$}] Equal object
\item[{$\square$}] 5 CHF *2 = 10 CHF
\end{itemize}

\begin{verbatim}
test "franc multiplication" do
  five = Franc.new(5)

  #    assert_equal(Dollar.new(10), product)
  assert_true(Franc.new(10).equals(five.times(2)))
  assert_true(Franc.new(15).equals(five.times(3)))
end
\end{verbatim}

\begin{verbatim}
class Franc
  protected attr_reader :amount
  def initialize(amount)
    @amount = amount
  end
  def times(multiplier)
    return Franc.new(@amount * multiplier)
  end
  def equals(object)
    franc = object
    return @amount == franc.amount
  end
end
\end{verbatim}

\section{c4 :: Privacy}
\label{sec:org17877cb}
\begin{itemize}
\item[{$\square$}] \$5 + 10CHF = \$10 (if rate is 2:1)
\item[{$\boxtimes$}] \$5 * 2 = \$10
\item[{$\boxtimes$}] Make "amount" private(protected)
\item[{$\boxtimes$}] Dollar side-effects?
\item[{$\square$}] Money rounding?
\item[{$\boxtimes$}] equals()
\item[{$\square$}] hashCode()
\item[{$\square$}] equal null
\item[{$\square$}] Equal object

\item[{$\square$}] 疑問1
c4の最初のtest変更はobject同士の比較となる．
\begin{verbatim}
assert_equal(Dollar.new(10), product)
\end{verbatim}

javaのassertEqualsのpropertyと思われるが，
assertEqualsが最初の引数のequals関数を呼び出しているものと
思われる．
Rubyでこれを実装するのは難しそう．なので，
\begin{verbatim}
assert_true(Dollar.new(10).equals(product))
\end{verbatim}

と書き換える．Dollarの実装はそのまま．

\item[{$\square$}] 疑問2
「@amountをprivateにする」という説明があるが，
これを失敗する．
equals method内でdollar.amountを使っているから．
この辺り，JavaのprivateとRubyのprivateの違いかも．
ここをRubyではprotectedにしている．
Rubyのprotected, private, public宣言は3.0からなので
注意が必要かも．
\end{itemize}

\begin{verbatim}
class Dollar
  protected attr_reader :amount
\end{verbatim}

\begin{verbatim}
test "multiplication" do
  five = Dollar.new(5)

  #    assert_equal(Dollar.new(10), product)
  assert_true(Dollar.new(10).equals(five.times(2)))
  assert_true(Dollar.new(15).equals(five.times(3)))
end
\end{verbatim}
\section{c3 :: Equality for All}
\label{sec:orgc153e61}
\begin{itemize}
\item[{$\square$}] \$5 + 10CHF = \$10 (if rate is 2:1)
\item[{$\boxtimes$}] \$5 * 2 = \$10
\item[{$\square$}] Make "amount" private
\item[{$\boxtimes$}] Dollar side-effects?
\item[{$\square$}] Money rounding?
\item[{$\boxtimes$}] equals()
\item[{$\square$}] hashCode()
\end{itemize}

\begin{verbatim}
test "equality" do
  assert_true(Dollar.new(5).equals(Dollar.new(5)))
  assert_false(Dollar.new(5).equals(Dollar.new(6)))
end
\end{verbatim}

\begin{verbatim}
def equals(object)
  dollar = object
  return @amount == dollar.amount
end
\end{verbatim}
