README.org
* c2 :: Degenerate Objects
- [ ] $5 + 10CHF = $10 (if rate is 2:1)
- [X] $5 * 2 = $10
- [ ] Make "amount" private
- [ ] Dollar side-effects?
- [ ] Money rounding?

- [ ] 疑問
  product = Dollar.new(five.times(2))となるはずだが，error
  が出るんで，product = five.times(2)と修正．timesがDollarを
  返してるんで．．．


#+begin_src ruby
# frozen_string_literal: true
require "test_helper"
class TddExample2Test < Test::Unit::TestCase
  include TddExample2
  test "multiplication" do
    five = Dollar.new(5)
    product = five.times(2)
    assert_equal(10, product.amount)
    product = five.times(3)
    assert_equal(15, product.amount)
  end
end
#+end_src

#+begin_src ruby
# frozen_string_literal: true

require_relative "tdd_example2/version"

module TddExample2
  class Error < StandardError; end
  # Your code goes here...
  class Dollar
    attr_reader :amount
    def initialize(amount)
      @amount = amount
    end
    def times(multiplier)
      return Dollar.new(@amount * multiplier)
    end
  end
end
#+end_src


* c1 :: Multi-Currency Money
- [ ] $5 + 10CHF = $10 (if rate is 2:1)
- [ ] $5 * 2 = $10
  - [ ] Make "amount" private
  - [ ] Dollar side-effects?
  - [ ] Money rounding?
#+begin_src ruby
# frozen_string_literal: true

require "test_helper"

class TddExample2Test < Test::Unit::TestCase
  include TddExample2
  test "VERSION" do
    assert do
      ::TddExample2.const_defined?(:VERSION)
    end
  end

  test "multiplication" do
    five = Dollar.new(5)
    five.times(2)
    assert_equal(10, five.amount)
  end
end
#+end_src

#+begin_src ruby
# frozen_string_literal: true

require_relative "tdd_example2/version"

module TddExample2
  class Error < StandardError; end
  # Your code goes here...
  class Dollar
    attr_reader :amount
    def initialize(amount)
      @amount = amount
    end
    def times(multiplier)
      @amount *= multiplier
    end
  end
end
#+end_src


