README.html

<div id="outline-container-orgd3b152a" class="outline-2">
<h2 id="orgd3b152a"><span class="section-number-2">15.</span> c2 :: Degenerate Objects</h2>
<div class="outline-text-2" id="text-15">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> $5 + 10CHF = $10 (if rate is 2:1)</li>
<li class="on"><code>[X]</code> $5 * 2 = $10</li>
<li class="off"><code>[&#xa0;]</code> Make "amount" private</li>
<li class="off"><code>[&#xa0;]</code> Dollar side-effects?</li>
<li class="off"><code>[&#xa0;]</code> Money rounding?</li>

<li class="off"><code>[&#xa0;]</code> 疑問
product = Dollar.new(five.times(2))となるはずだが，error
が出るんで，product = five.times(2)と修正．timesがDollarを
返してるんで．．．</li>
</ul>


<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">frozen_string_literal: true</span>
<span style="color: #cd6600;">require</span> <span style="color: #8b7355;">"test_helper"</span>
<span style="color: #1c86ee;">class</span> <span style="color: #00688b;">TddExample2Test</span> &lt; <span style="color: #00688b;">Test</span>::<span style="color: #00688b;">Unit</span>::<span style="color: #00688b;">TestCase</span>
  <span style="color: #cd6600;">include</span> <span style="color: #00688b;">TddExample2</span>
  test <span style="color: #8b7355;">"multiplication"</span> <span style="color: #1c86ee;">do</span>
    five = <span style="color: #00688b;">Dollar</span>.new(5)
    product = five.times(2)
    assert_equal(10, product.amount)
    product = five.times(3)
    assert_equal(15, product.amount)
  <span style="color: #1c86ee;">end</span>
<span style="color: #1c86ee;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">frozen_string_literal: true</span>

<span style="color: #cd6600;">require_relative</span> <span style="color: #8b7355;">"tdd_example2/version"</span>

<span style="color: #1c86ee;">module</span> <span style="color: #00688b;">TddExample2</span>
  <span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Error</span> &lt; <span style="color: #00688b;">StandardError</span>; <span style="color: #1c86ee;">end</span>
  <span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">Your code goes here...</span>
  <span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Dollar</span>
    <span style="color: #cd6600;">attr_reader</span> <span style="color: #6e8b3d;">:amount</span>
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">initialize</span>(amount)
      <span style="color: #2e8b57;">@amount</span> = amount
    <span style="color: #1c86ee;">end</span>
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">times</span>(multiplier)
      <span style="color: #1c86ee;">return</span> <span style="color: #00688b;">Dollar</span>.new(<span style="color: #2e8b57;">@amount</span> * multiplier)
    <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">end</span>
<span style="color: #1c86ee;">end</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org488a4d4" class="outline-2">
<h2 id="org488a4d4"><span class="section-number-2">16.</span> c1 :: Multi-Currency Money</h2>
<div class="outline-text-2" id="text-16">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> $5 + 10CHF = $10 (if rate is 2:1)</li>
<li class="off"><code>[&#xa0;]</code> $5 * 2 = $10
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Make "amount" private</li>
<li class="off"><code>[&#xa0;]</code> Dollar side-effects?</li>
<li class="off"><code>[&#xa0;]</code> Money rounding?</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">frozen_string_literal: true</span>

<span style="color: #cd6600;">require</span> <span style="color: #8b7355;">"test_helper"</span>

<span style="color: #1c86ee;">class</span> <span style="color: #00688b;">TddExample2Test</span> &lt; <span style="color: #00688b;">Test</span>::<span style="color: #00688b;">Unit</span>::<span style="color: #00688b;">TestCase</span>
  <span style="color: #cd6600;">include</span> <span style="color: #00688b;">TddExample2</span>
  test <span style="color: #8b7355;">"VERSION"</span> <span style="color: #1c86ee;">do</span>
    assert <span style="color: #1c86ee;">do</span>
      ::<span style="color: #00688b;">TddExample2</span>.const_defined?(<span style="color: #6e8b3d;">:VERSION</span>)
    <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">end</span>

  test <span style="color: #8b7355;">"multiplication"</span> <span style="color: #1c86ee;">do</span>
    five = <span style="color: #00688b;">Dollar</span>.new(5)
    five.times(2)
    assert_equal(10, five.amount)
  <span style="color: #1c86ee;">end</span>
<span style="color: #1c86ee;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">frozen_string_literal: true</span>

<span style="color: #cd6600;">require_relative</span> <span style="color: #8b7355;">"tdd_example2/version"</span>

<span style="color: #1c86ee;">module</span> <span style="color: #00688b;">TddExample2</span>
  <span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Error</span> &lt; <span style="color: #00688b;">StandardError</span>; <span style="color: #1c86ee;">end</span>
  <span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">Your code goes here...</span>
  <span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Dollar</span>
    <span style="color: #cd6600;">attr_reader</span> <span style="color: #6e8b3d;">:amount</span>
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">initialize</span>(amount)
      <span style="color: #2e8b57;">@amount</span> = amount
    <span style="color: #1c86ee;">end</span>
    <span style="color: #1c86ee;">def</span> <span style="color: #cd9b1d;">times</span>(multiplier)
      <span style="color: #2e8b57;">@amount</span> *= multiplier
    <span style="color: #1c86ee;">end</span>
  <span style="color: #1c86ee;">end</span>
<span style="color: #1c86ee;">end</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2023-09-11 Mon 11:21</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
