README.tex

\section{c2 :: Degenerate Objects}
\label{sec:orgf58e0b7}
\begin{itemize}
\item[{$\square$}] \$5 + 10CHF = \$10 (if rate is 2:1)
\item[{$\boxtimes$}] \$5 * 2 = \$10
\item[{$\square$}] Make "amount" private
\item[{$\square$}] Dollar side-effects?
\item[{$\square$}] Money rounding?

\item[{$\square$}] 疑問
product = Dollar.new(five.times(2))となるはずだが，error
が出るんで，product = five.times(2)と修正．timesがDollarを
返してるんで．．．
\end{itemize}


\begin{verbatim}
# frozen_string_literal: true
require "test_helper"
class TddExample2Test < Test::Unit::TestCase
  include TddExample2
  test "multiplication" do
    five = Dollar.new(5)
    product = five.times(2)
    assert_equal(10, product.amount)
    product = five.times(3)
    assert_equal(15, product.amount)
  end
end
\end{verbatim}

\begin{verbatim}
# frozen_string_literal: true

require_relative "tdd_example2/version"

module TddExample2
  class Error < StandardError; end
  # Your code goes here...
  class Dollar
    attr_reader :amount
    def initialize(amount)
      @amount = amount
    end
    def times(multiplier)
      return Dollar.new(@amount * multiplier)
    end
  end
end
\end{verbatim}


\section{c1 :: Multi-Currency Money}
\label{sec:orgc276672}
\begin{itemize}
\item[{$\square$}] \$5 + 10CHF = \$10 (if rate is 2:1)
\item[{$\square$}] \$5 * 2 = \$10
\begin{itemize}
\item[{$\square$}] Make "amount" private
\item[{$\square$}] Dollar side-effects?
\item[{$\square$}] Money rounding?
\end{itemize}
\end{itemize}
\begin{verbatim}
# frozen_string_literal: true

require "test_helper"

class TddExample2Test < Test::Unit::TestCase
  include TddExample2
  test "VERSION" do
    assert do
      ::TddExample2.const_defined?(:VERSION)
    end
  end

  test "multiplication" do
    five = Dollar.new(5)
    five.times(2)
    assert_equal(10, five.amount)
  end
end
\end{verbatim}

\begin{verbatim}
# frozen_string_literal: true

require_relative "tdd_example2/version"

module TddExample2
  class Error < StandardError; end
  # Your code goes here...
  class Dollar
    attr_reader :amount
    def initialize(amount)
      @amount = amount
    end
    def times(multiplier)
      @amount *= multiplier
    end
  end
end
\end{verbatim}
\end{document}